mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xm/common/mb9bf16xm.h
typedef struct stc_rtc_vbdor_field
{
        __IO   uint8_t  VDOR0                    :1;
        __IO   uint8_t  VDOR1                    :1;
        __IO   uint8_t  VDOR2                    :1;
        __IO   uint8_t  VDOR3                    :1;
        __IO   uint8_t  RESERVED0                :4;
} stc_rtc_vbdor_field_t;

typedef struct stc_rtc_vbpzr_field
{
        __IO   uint8_t  VPZR0                    :1;
        __IO   uint8_t  VPZR1                    :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_rtc_vbpzr_field_t;

/*******************************************************************************
* SBSSR_MODULE
*******************************************************************************/
typedef struct stc_sbssr_btsssr_field
{
        __IO  uint16_t  SSSR0                    :1;
        __IO  uint16_t  SSSR1                    :1;
        __IO  uint16_t  SSSR2                    :1;
        __IO  uint16_t  SSSR3                    :1;
        __IO  uint16_t  SSSR4                    :1;
        __IO  uint16_t  SSSR5                    :1;
        __IO  uint16_t  SSSR6                    :1;
        __IO  uint16_t  SSSR7                    :1;
        __IO  uint16_t  SSSR8                    :1;
        __IO  uint16_t  SSSR9                    :1;
        __IO  uint16_t  SSSR10                   :1;
        __IO  uint16_t  SSSR11                   :1;
        __IO  uint16_t  SSSR12                   :1;
        __IO  uint16_t  SSSR13                   :1;
        __IO  uint16_t  SSSR14                   :1;
        __IO  uint16_t  SSSR15                   :1;
} stc_sbssr_btsssr_field_t;

/*******************************************************************************
* SDIF_MODULE
*******************************************************************************/
typedef struct stc_sdif_sbsize_field
{
    union {
        struct {
            __IO  uint16_t  TRSFBLCKSZ           :12;
            __IO  uint16_t  HSDMABUFBD           :3;
            __IO  uint16_t  RESERVED0            :1;
        };
        struct {
            __IO  uint16_t  TRSFBLCKSZ0          :1;
            __IO  uint16_t  TRSFBLCKSZ1          :1;
            __IO  uint16_t  TRSFBLCKSZ2          :1;
            __IO  uint16_t  TRSFBLCKSZ3          :1;
            __IO  uint16_t  TRSFBLCKSZ4          :1;
            __IO  uint16_t  TRSFBLCKSZ5          :1;
            __IO  uint16_t  TRSFBLCKSZ6          :1;
            __IO  uint16_t  TRSFBLCKSZ7          :1;
            __IO  uint16_t  TRSFBLCKSZ8          :1;
            __IO  uint16_t  TRSFBLCKSZ9          :1;
            __IO  uint16_t  TRSFBLCKSZ10         :1;
            __IO  uint16_t  TRSFBLCKSZ11         :1;
            __IO  uint16_t  HSDMABUFBD0          :1;
            __IO  uint16_t  HSDMABUFBD1          :1;
            __IO  uint16_t  HSDMABUFBD2          :1;
            __IO  uint16_t  RESERVED1            :1;
        };
    };
} stc_sdif_sbsize_field_t;

typedef struct stc_sdif_strsfmd_field
{
    union {
        struct {
            __IO  uint16_t  DMAEN                :1;
            __IO  uint16_t  BLCKCNTEN            :1;
            __IO  uint16_t  AUTOCMDEN            :2;
            __IO  uint16_t  DTTRSFDIR            :1;
            __IO  uint16_t  BLCKCNTSEL           :1;
            __IO  uint16_t  RESERVED1            :10;
        };
        struct {
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  AUTOCMDEN0           :1;
            __IO  uint16_t  AUTOCMDEN1           :1;
            __IO  uint16_t  RESERVED2            :12;
        };
    };
} stc_sdif_strsfmd_field_t;

typedef struct stc_sdif_scmmd_field
{
    union {
        struct {
            __IO  uint16_t  RESPTYPE             :2;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  CMDCRCCHKE           :1;
            __IO  uint16_t  CMDIDXCHKE           :1;
            __IO  uint16_t  DATPRESSEL           :1;
            __IO  uint16_t  CMDTYPE              :2;
            __IO  uint16_t  CMDINDEX             :6;
            __IO  uint16_t  RESERVED2            :2;
        };
        struct {
            __IO  uint16_t  RESPTYPE0            :1;
            __IO  uint16_t  RESPTYPE1            :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  CMDTYPE0             :1;
            __IO  uint16_t  CMDTYPE1             :1;
            __IO  uint16_t  CMDINDEX0            :1;
            __IO  uint16_t  CMDINDEX1            :1;
            __IO  uint16_t  CMDINDEX2            :1;
            __IO  uint16_t  CMDINDEX3            :1;
            __IO  uint16_t  CMDINDEX4            :1;
            __IO  uint16_t  CMDINDEX5            :1;
            __IO  uint16_t  RESERVED3            :2;
        };
    };
} stc_sdif_scmmd_field_t;

typedef struct stc_sdif_sprstat_field
{
    union {
        struct {
            __IO  uint32_t  CMDINH               :1;
            __IO  uint32_t  CMDDATINH            :1;
            __IO  uint32_t  DATLNACT             :1;
            __IO  uint32_t  RETUNEREQ            :1;
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  WRTRSFACT            :1;
            __IO  uint32_t  RDTRSFACT            :1;
            __IO  uint32_t  BUFWREN              :1;
            __IO  uint32_t  BUFRDEN              :1;
            __IO  uint32_t  RESERVED1            :4;
            __IO  uint32_t  CARDINS              :1;
            __IO  uint32_t  CARDSTB              :1;
            __IO  uint32_t  CARDDET              :1;
            __IO  uint32_t  WPPINLVL             :1;
            __IO  uint32_t  LNSGNLVL             :4;
            __IO  uint32_t  CMDLNSGN             :1;
            __IO  uint32_t  RESERVED3            :7;
        };
        struct {
            __IO  uint32_t  RESERVED2            :20;
            __IO  uint32_t  LNSGNLVL0            :1;
            __IO  uint32_t  LNSGNLVL1            :1;
            __IO  uint32_t  LNSGNLVL2            :1;
            __IO  uint32_t  LNSGNLVL3            :1;
            __IO  uint32_t  RESERVED4            :8;
        };
    };
} stc_sdif_sprstat_field_t;

typedef struct stc_sdif_shctl1_field
{
    union {
        struct {
            __IO   uint8_t  LEDCTRL              :1;
            __IO   uint8_t  DATAWIDTH            :1;
            __IO   uint8_t  HIGHSPDEN            :1;
            __IO   uint8_t  DMASEL               :2;
            __IO   uint8_t  EXTDTWIDTH           :1;
            __IO   uint8_t  CDTSTLVL             :1;
            __IO   uint8_t  CDSGNSEL             :1;
        };
        struct {
            __IO   uint8_t  RESERVED0            :3;
            __IO   uint8_t  DMASEL0              :1;
            __IO   uint8_t  DMASEL1              :1;
            __IO   uint8_t  RESERVED1            :3;
        };
    };
} stc_sdif_shctl1_field_t;

typedef struct stc_sdif_spwrctl_field
{
    union {
        struct {
            __IO   uint8_t  SDBUSPWR             :1;
            __IO   uint8_t  SDBUSVLSEL           :3;
            __IO   uint8_t  RESERVED1            :4;
        };
        struct {
            __IO   uint8_t  RESERVED0            :1;
            __IO   uint8_t  SDBUSVLSEL0          :1;
            __IO   uint8_t  SDBUSVLSEL1          :1;
            __IO   uint8_t  SDBUSVLSEL2          :1;
            __IO   uint8_t  RESERVED2            :4;
        };
    };
} stc_sdif_spwrctl_field_t;

typedef struct stc_sdif_sblkgpctl_field
{
        __IO   uint8_t  BLCKGSTPREQ              :1;
        __IO   uint8_t  CONTREQ                  :1;
        __IO   uint8_t  RDWAITCTL                :1;
        __IO   uint8_t  BLCKGAPINT               :1;
        __IO   uint8_t  RESERVED0                :4;
} stc_sdif_sblkgpctl_field_t;

typedef struct stc_sdif_swkupctl_field
{
        __IO   uint8_t  WKUPEVNTEN0              :1;
        __IO   uint8_t  WKUPEVNTEN1              :1;
        __IO   uint8_t  WKUPEVNTEN2              :1;
        __IO   uint8_t  RESERVED0                :5;
} stc_sdif_swkupctl_field_t;

typedef struct stc_sdif_sclkctl_field
{
    union {
        struct {
            __IO  uint16_t  INTLCLCKEN           :1;
            __IO  uint16_t  INTLCLCKST           :1;
            __IO  uint16_t  SDCLCKEN             :1;
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  CLCKGENSEL           :1;
            __IO  uint16_t  UPSDCLKSEL           :2;
            __IO  uint16_t  SDCLKSEL             :8;
        };
        struct {
            __IO  uint16_t  RESERVED1            :6;
            __IO  uint16_t  UPSDCLKSEL0          :1;
            __IO  uint16_t  UPSDCLKSEL1          :1;
            __IO  uint16_t  SDCLKSEL0            :1;
            __IO  uint16_t  SDCLKSEL1            :1;
            __IO  uint16_t  SDCLKSEL2            :1;
            __IO  uint16_t  SDCLKSEL3            :1;
            __IO  uint16_t  SDCLKSEL4            :1;
            __IO  uint16_t  SDCLKSEL5            :1;
            __IO  uint16_t  SDCLKSEL6            :1;
            __IO  uint16_t  SDCLKSEL7            :1;
        };
    };
} stc_sdif_sclkctl_field_t;

typedef struct stc_sdif_stoctl_field
{
    union {
        struct {
            __IO   uint8_t  DTTMOUTVAL           :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  DTTMOUTVAL0          :1;
            __IO   uint8_t  DTTMOUTVAL1          :1;
            __IO   uint8_t  DTTMOUTVAL2          :1;
            __IO   uint8_t  DTTMOUTVAL3          :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_sdif_stoctl_field_t;

