mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xm/common/mb9bf16xm.h
typedef struct stc_sdif_mxccapy1_field
{
    union {
        struct {
            __IO  uint16_t  V18MAXCUR            :8;
            __IO  uint16_t  RESERVED0            :8;
        };
        struct {
            __IO  uint16_t  V18MAXCUR0           :1;
            __IO  uint16_t  V18MAXCUR1           :1;
            __IO  uint16_t  V18MAXCUR2           :1;
            __IO  uint16_t  V18MAXCUR3           :1;
            __IO  uint16_t  V18MAXCUR4           :1;
            __IO  uint16_t  V18MAXCUR5           :1;
            __IO  uint16_t  V18MAXCUR6           :1;
            __IO  uint16_t  V18MAXCUR7           :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_sdif_mxccapy1_field_t;

typedef struct stc_sdif_feacest_field
{
        __IO  uint16_t  FEVNT12ND                :1;
        __IO  uint16_t  FEVNTTO                  :1;
        __IO  uint16_t  FEVNTCRC                 :1;
        __IO  uint16_t  FEVNTEB                  :1;
        __IO  uint16_t  FEVNTIDX                 :1;
        __IO  uint16_t  RESERVED0                :2;
        __IO  uint16_t  FEVNTCMD12               :1;
        __IO  uint16_t  RESERVED1                :8;
} stc_sdif_feacest_field_t;

typedef struct stc_sdif_sfeeist_field
{
        __IO  uint16_t  FETOERR                  :1;
        __IO  uint16_t  FECRCERR                 :1;
        __IO  uint16_t  FEEBERR                  :1;
        __IO  uint16_t  FEIDXERR                 :1;
        __IO  uint16_t  FEDTOTERR                :1;
        __IO  uint16_t  FEDTCRCERR               :1;
        __IO  uint16_t  FEDTEBERR                :1;
        __IO  uint16_t  FECRLTERR                :1;
        __IO  uint16_t  FEA12ERR                 :1;
        __IO  uint16_t  FEADMAERR                :1;
        __IO  uint16_t  FETUNEERR                :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  FEACKERR                 :1;
        __IO  uint16_t  FEA19ERR                 :1;
        __IO  uint16_t  FEAHBMSERR               :1;
        __IO  uint16_t  RESERVED1                :1;
} stc_sdif_sfeeist_field_t;

typedef struct stc_sdif_admaest_field
{
    union {
        struct {
            __IO   uint8_t  ADMAERRS             :2;
            __IO   uint8_t  ADMALENME            :1;
            __IO   uint8_t  RESERVED0            :5;
        };
        struct {
            __IO   uint8_t  ADMAERRS0            :1;
            __IO   uint8_t  ADMAERRS1            :1;
            __IO   uint8_t  RESERVED1            :6;
        };
    };
} stc_sdif_admaest_field_t;

typedef struct stc_sdif_sadsa0_field
{
    union {
        struct {
            __IO  uint16_t  ADR1500              :16;
        };
        struct {
            __IO  uint16_t  ADR15000             :1;
            __IO  uint16_t  ADR15001             :1;
            __IO  uint16_t  ADR15002             :1;
            __IO  uint16_t  ADR15003             :1;
            __IO  uint16_t  ADR15004             :1;
            __IO  uint16_t  ADR15005             :1;
            __IO  uint16_t  ADR15006             :1;
            __IO  uint16_t  ADR15007             :1;
            __IO  uint16_t  ADR15008             :1;
            __IO  uint16_t  ADR15009             :1;
            __IO  uint16_t  ADR150010            :1;
            __IO  uint16_t  ADR150011            :1;
            __IO  uint16_t  ADR150012            :1;
            __IO  uint16_t  ADR150013            :1;
            __IO  uint16_t  ADR150014            :1;
            __IO  uint16_t  ADR150015            :1;
        };
    };
} stc_sdif_sadsa0_field_t;

typedef struct stc_sdif_sadsa1_field
{
    union {
        struct {
            __IO  uint16_t  ADR3116              :16;
        };
        struct {
            __IO  uint16_t  ADR31160             :1;
            __IO  uint16_t  ADR31161             :1;
            __IO  uint16_t  ADR31162             :1;
            __IO  uint16_t  ADR31163             :1;
            __IO  uint16_t  ADR31164             :1;
            __IO  uint16_t  ADR31165             :1;
            __IO  uint16_t  ADR31166             :1;
            __IO  uint16_t  ADR31167             :1;
            __IO  uint16_t  ADR31168             :1;
            __IO  uint16_t  ADR31169             :1;
            __IO  uint16_t  ADR311610            :1;
            __IO  uint16_t  ADR311611            :1;
            __IO  uint16_t  ADR311612            :1;
            __IO  uint16_t  ADR311613            :1;
            __IO  uint16_t  ADR311614            :1;
            __IO  uint16_t  ADR311615            :1;
        };
    };
} stc_sdif_sadsa1_field_t;

typedef struct stc_sdif_sadsa2_field
{
    union {
        struct {
            __IO  uint16_t  ADR4732              :16;
        };
        struct {
            __IO  uint16_t  ADR47320             :1;
            __IO  uint16_t  ADR47321             :1;
            __IO  uint16_t  ADR47322             :1;
            __IO  uint16_t  ADR47323             :1;
            __IO  uint16_t  ADR47324             :1;
            __IO  uint16_t  ADR47325             :1;
            __IO  uint16_t  ADR47326             :1;
            __IO  uint16_t  ADR47327             :1;
            __IO  uint16_t  ADR47328             :1;
            __IO  uint16_t  ADR47329             :1;
            __IO  uint16_t  ADR473210            :1;
            __IO  uint16_t  ADR473211            :1;
            __IO  uint16_t  ADR473212            :1;
            __IO  uint16_t  ADR473213            :1;
            __IO  uint16_t  ADR473214            :1;
            __IO  uint16_t  ADR473215            :1;
        };
    };
} stc_sdif_sadsa2_field_t;

typedef struct stc_sdif_sadsa3_field
{
    union {
        struct {
            __IO  uint16_t  ADR6348              :16;
        };
        struct {
            __IO  uint16_t  ADR63480             :1;
            __IO  uint16_t  ADR63481             :1;
            __IO  uint16_t  ADR63482             :1;
            __IO  uint16_t  ADR63483             :1;
            __IO  uint16_t  ADR63484             :1;
            __IO  uint16_t  ADR63485             :1;
            __IO  uint16_t  ADR63486             :1;
            __IO  uint16_t  ADR63487             :1;
            __IO  uint16_t  ADR63488             :1;
            __IO  uint16_t  ADR63489             :1;
            __IO  uint16_t  ADR634810            :1;
            __IO  uint16_t  ADR634811            :1;
            __IO  uint16_t  ADR634812            :1;
            __IO  uint16_t  ADR634813            :1;
            __IO  uint16_t  ADR634814            :1;
            __IO  uint16_t  ADR634815            :1;
        };
    };
} stc_sdif_sadsa3_field_t;

typedef struct stc_sdif_sprval0_field
{
    union {
        struct {
            __IO  uint16_t  SCFSELVAL            :10;
            __IO  uint16_t  CGSELVAL             :1;
            __IO  uint16_t  RESERVED0            :3;
            __IO  uint16_t  DSSELVAL             :2;
        };
        struct {
            __IO  uint16_t  SCFSELVAL0           :1;
            __IO  uint16_t  SCFSELVAL1           :1;
            __IO  uint16_t  SCFSELVAL2           :1;
            __IO  uint16_t  SCFSELVAL3           :1;
            __IO  uint16_t  SCFSELVAL4           :1;
            __IO  uint16_t  SCFSELVAL5           :1;
            __IO  uint16_t  SCFSELVAL6           :1;
            __IO  uint16_t  SCFSELVAL7           :1;
            __IO  uint16_t  SCFSELVAL8           :1;
            __IO  uint16_t  SCFSELVAL9           :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  DSSELVAL0            :1;
            __IO  uint16_t  DSSELVAL1            :1;
        };
    };
} stc_sdif_sprval0_field_t;

typedef struct stc_sdif_sprval1_field
{
    union {
        struct {
            __IO  uint16_t  SCFSELVAL            :10;
            __IO  uint16_t  CGSELVAL             :1;
            __IO  uint16_t  RESERVED0            :3;
            __IO  uint16_t  DSSELVAL             :2;
        };
        struct {
            __IO  uint16_t  SCFSELVAL0           :1;
            __IO  uint16_t  SCFSELVAL1           :1;
            __IO  uint16_t  SCFSELVAL2           :1;
            __IO  uint16_t  SCFSELVAL3           :1;
            __IO  uint16_t  SCFSELVAL4           :1;
            __IO  uint16_t  SCFSELVAL5           :1;
            __IO  uint16_t  SCFSELVAL6           :1;
            __IO  uint16_t  SCFSELVAL7           :1;
            __IO  uint16_t  SCFSELVAL8           :1;
            __IO  uint16_t  SCFSELVAL9           :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  DSSELVAL0            :1;
            __IO  uint16_t  DSSELVAL1            :1;
        };
    };
} stc_sdif_sprval1_field_t;

