mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xm/common/mb9bf16xm.h
#define bFM_GPIO_DDR0_P0                          *((volatile  uint8_t *)(0x42DE4000UL))
#define bFM4_GPIO_DDR0_P0                         *((volatile  uint8_t *)(0x42DE4000UL))
#define bFM_GPIO_DDR0_P1                          *((volatile  uint8_t *)(0x42DE4004UL))
#define bFM4_GPIO_DDR0_P1                         *((volatile  uint8_t *)(0x42DE4004UL))
#define bFM_GPIO_DDR0_P2                          *((volatile  uint8_t *)(0x42DE4008UL))
#define bFM4_GPIO_DDR0_P2                         *((volatile  uint8_t *)(0x42DE4008UL))
#define bFM_GPIO_DDR0_P3                          *((volatile  uint8_t *)(0x42DE400CUL))
#define bFM4_GPIO_DDR0_P3                         *((volatile  uint8_t *)(0x42DE400CUL))
#define bFM_GPIO_DDR0_P4                          *((volatile  uint8_t *)(0x42DE4010UL))
#define bFM4_GPIO_DDR0_P4                         *((volatile  uint8_t *)(0x42DE4010UL))
#define bFM_GPIO_DDR0_P9                          *((volatile  uint8_t *)(0x42DE4024UL))
#define bFM4_GPIO_DDR0_P9                         *((volatile  uint8_t *)(0x42DE4024UL))
#define bFM_GPIO_DDR0_PA                          *((volatile  uint8_t *)(0x42DE4028UL))
#define bFM4_GPIO_DDR0_PA                         *((volatile  uint8_t *)(0x42DE4028UL))
#define bFM_GPIO_DDR0_PB                          *((volatile  uint8_t *)(0x42DE402CUL))
#define bFM4_GPIO_DDR0_PB                         *((volatile  uint8_t *)(0x42DE402CUL))
#define bFM_GPIO_DDR0_PC                          *((volatile  uint8_t *)(0x42DE4030UL))
#define bFM4_GPIO_DDR0_PC                         *((volatile  uint8_t *)(0x42DE4030UL))
#define bFM_GPIO_DDR0_PD                          *((volatile  uint8_t *)(0x42DE4034UL))
#define bFM4_GPIO_DDR0_PD                         *((volatile  uint8_t *)(0x42DE4034UL))
#define bFM_GPIO_DDR0_PE                          *((volatile  uint8_t *)(0x42DE4038UL))
#define bFM4_GPIO_DDR0_PE                         *((volatile  uint8_t *)(0x42DE4038UL))

#define bFM_GPIO_DDR1_P0                          *((volatile  uint8_t *)(0x42DE4080UL))
#define bFM4_GPIO_DDR1_P0                         *((volatile  uint8_t *)(0x42DE4080UL))
#define bFM_GPIO_DDR1_P1                          *((volatile  uint8_t *)(0x42DE4084UL))
#define bFM4_GPIO_DDR1_P1                         *((volatile  uint8_t *)(0x42DE4084UL))
#define bFM_GPIO_DDR1_P2                          *((volatile  uint8_t *)(0x42DE4088UL))
#define bFM4_GPIO_DDR1_P2                         *((volatile  uint8_t *)(0x42DE4088UL))
#define bFM_GPIO_DDR1_P3                          *((volatile  uint8_t *)(0x42DE408CUL))
#define bFM4_GPIO_DDR1_P3                         *((volatile  uint8_t *)(0x42DE408CUL))
#define bFM_GPIO_DDR1_P4                          *((volatile  uint8_t *)(0x42DE4090UL))
#define bFM4_GPIO_DDR1_P4                         *((volatile  uint8_t *)(0x42DE4090UL))
#define bFM_GPIO_DDR1_P5                          *((volatile  uint8_t *)(0x42DE4094UL))
#define bFM4_GPIO_DDR1_P5                         *((volatile  uint8_t *)(0x42DE4094UL))
#define bFM_GPIO_DDR1_P6                          *((volatile  uint8_t *)(0x42DE4098UL))
#define bFM4_GPIO_DDR1_P6                         *((volatile  uint8_t *)(0x42DE4098UL))
#define bFM_GPIO_DDR1_P7                          *((volatile  uint8_t *)(0x42DE409CUL))
#define bFM4_GPIO_DDR1_P7                         *((volatile  uint8_t *)(0x42DE409CUL))
#define bFM_GPIO_DDR1_P8                          *((volatile  uint8_t *)(0x42DE40A0UL))
#define bFM4_GPIO_DDR1_P8                         *((volatile  uint8_t *)(0x42DE40A0UL))
#define bFM_GPIO_DDR1_P9                          *((volatile  uint8_t *)(0x42DE40A4UL))
#define bFM4_GPIO_DDR1_P9                         *((volatile  uint8_t *)(0x42DE40A4UL))
#define bFM_GPIO_DDR1_PA                          *((volatile  uint8_t *)(0x42DE40A8UL))
#define bFM4_GPIO_DDR1_PA                         *((volatile  uint8_t *)(0x42DE40A8UL))
#define bFM_GPIO_DDR1_PB                          *((volatile  uint8_t *)(0x42DE40ACUL))
#define bFM4_GPIO_DDR1_PB                         *((volatile  uint8_t *)(0x42DE40ACUL))

#define bFM_GPIO_DDR2_P1                          *((volatile  uint8_t *)(0x42DE4104UL))
#define bFM4_GPIO_DDR2_P1                         *((volatile  uint8_t *)(0x42DE4104UL))
#define bFM_GPIO_DDR2_P2                          *((volatile  uint8_t *)(0x42DE4108UL))
#define bFM4_GPIO_DDR2_P2                         *((volatile  uint8_t *)(0x42DE4108UL))
#define bFM_GPIO_DDR2_P3                          *((volatile  uint8_t *)(0x42DE410CUL))
#define bFM4_GPIO_DDR2_P3                         *((volatile  uint8_t *)(0x42DE410CUL))

#define bFM_GPIO_DDR3_P0                          *((volatile  uint8_t *)(0x42DE4180UL))
#define bFM4_GPIO_DDR3_P0                         *((volatile  uint8_t *)(0x42DE4180UL))
#define bFM_GPIO_DDR3_P1                          *((volatile  uint8_t *)(0x42DE4184UL))
#define bFM4_GPIO_DDR3_P1                         *((volatile  uint8_t *)(0x42DE4184UL))
#define bFM_GPIO_DDR3_P2                          *((volatile  uint8_t *)(0x42DE4188UL))
#define bFM4_GPIO_DDR3_P2                         *((volatile  uint8_t *)(0x42DE4188UL))
#define bFM_GPIO_DDR3_P3                          *((volatile  uint8_t *)(0x42DE418CUL))
#define bFM4_GPIO_DDR3_P3                         *((volatile  uint8_t *)(0x42DE418CUL))
#define bFM_GPIO_DDR3_P9                          *((volatile  uint8_t *)(0x42DE41A4UL))
#define bFM4_GPIO_DDR3_P9                         *((volatile  uint8_t *)(0x42DE41A4UL))
#define bFM_GPIO_DDR3_PA                          *((volatile  uint8_t *)(0x42DE41A8UL))
#define bFM4_GPIO_DDR3_PA                         *((volatile  uint8_t *)(0x42DE41A8UL))
#define bFM_GPIO_DDR3_PB                          *((volatile  uint8_t *)(0x42DE41ACUL))
#define bFM4_GPIO_DDR3_PB                         *((volatile  uint8_t *)(0x42DE41ACUL))
#define bFM_GPIO_DDR3_PC                          *((volatile  uint8_t *)(0x42DE41B0UL))
#define bFM4_GPIO_DDR3_PC                         *((volatile  uint8_t *)(0x42DE41B0UL))
#define bFM_GPIO_DDR3_PD                          *((volatile  uint8_t *)(0x42DE41B4UL))
#define bFM4_GPIO_DDR3_PD                         *((volatile  uint8_t *)(0x42DE41B4UL))
#define bFM_GPIO_DDR3_PE                          *((volatile  uint8_t *)(0x42DE41B8UL))
#define bFM4_GPIO_DDR3_PE                         *((volatile  uint8_t *)(0x42DE41B8UL))
#define bFM_GPIO_DDR3_PF                          *((volatile  uint8_t *)(0x42DE41BCUL))
#define bFM4_GPIO_DDR3_PF                         *((volatile  uint8_t *)(0x42DE41BCUL))

#define bFM_GPIO_DDR4_P4                          *((volatile  uint8_t *)(0x42DE4210UL))
#define bFM4_GPIO_DDR4_P4                         *((volatile  uint8_t *)(0x42DE4210UL))
#define bFM_GPIO_DDR4_P5                          *((volatile  uint8_t *)(0x42DE4214UL))
#define bFM4_GPIO_DDR4_P5                         *((volatile  uint8_t *)(0x42DE4214UL))
#define bFM_GPIO_DDR4_P6                          *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P6                         *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM_GPIO_DDR4_P7                          *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P7                         *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM_GPIO_DDR4_P8                          *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P8                         *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM_GPIO_DDR4_P9                          *((volatile  uint8_t *)(0x42DE4224UL))
#define bFM4_GPIO_DDR4_P9                         *((volatile  uint8_t *)(0x42DE4224UL))
#define bFM_GPIO_DDR4_PB                          *((volatile  uint8_t *)(0x42DE422CUL))
#define bFM4_GPIO_DDR4_PB                         *((volatile  uint8_t *)(0x42DE422CUL))
#define bFM_GPIO_DDR4_PC                          *((volatile  uint8_t *)(0x42DE4230UL))
#define bFM4_GPIO_DDR4_PC                         *((volatile  uint8_t *)(0x42DE4230UL))
#define bFM_GPIO_DDR4_PD                          *((volatile  uint8_t *)(0x42DE4234UL))
#define bFM4_GPIO_DDR4_PD                         *((volatile  uint8_t *)(0x42DE4234UL))
#define bFM_GPIO_DDR4_PE                          *((volatile  uint8_t *)(0x42DE4238UL))
#define bFM4_GPIO_DDR4_PE                         *((volatile  uint8_t *)(0x42DE4238UL))

#define bFM_GPIO_DDR5_P0                          *((volatile  uint8_t *)(0x42DE4280UL))
#define bFM4_GPIO_DDR5_P0                         *((volatile  uint8_t *)(0x42DE4280UL))
#define bFM_GPIO_DDR5_P1                          *((volatile  uint8_t *)(0x42DE4284UL))
#define bFM4_GPIO_DDR5_P1                         *((volatile  uint8_t *)(0x42DE4284UL))
#define bFM_GPIO_DDR5_P2                          *((volatile  uint8_t *)(0x42DE4288UL))
#define bFM4_GPIO_DDR5_P2                         *((volatile  uint8_t *)(0x42DE4288UL))
#define bFM_GPIO_DDR5_P3                          *((volatile  uint8_t *)(0x42DE428CUL))
#define bFM4_GPIO_DDR5_P3                         *((volatile  uint8_t *)(0x42DE428CUL))
#define bFM_GPIO_DDR5_P4                          *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P4                         *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM_GPIO_DDR5_P5                          *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P5                         *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM_GPIO_DDR5_P6                          *((volatile  uint8_t *)(0x42DE4298UL))
#define bFM4_GPIO_DDR5_P6                         *((volatile  uint8_t *)(0x42DE4298UL))

