mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xm/common/mb9bf16xm.h
#define bFM_GPIO_PDIR5_P0                         *((volatile  uint8_t *)(0x42DE6280UL))
#define bFM4_GPIO_PDIR5_P0                        *((volatile  uint8_t *)(0x42DE6280UL))
#define bFM_GPIO_PDIR5_P1                         *((volatile  uint8_t *)(0x42DE6284UL))
#define bFM4_GPIO_PDIR5_P1                        *((volatile  uint8_t *)(0x42DE6284UL))
#define bFM_GPIO_PDIR5_P2                         *((volatile  uint8_t *)(0x42DE6288UL))
#define bFM4_GPIO_PDIR5_P2                        *((volatile  uint8_t *)(0x42DE6288UL))
#define bFM_GPIO_PDIR5_P3                         *((volatile  uint8_t *)(0x42DE628CUL))
#define bFM4_GPIO_PDIR5_P3                        *((volatile  uint8_t *)(0x42DE628CUL))
#define bFM_GPIO_PDIR5_P4                         *((volatile  uint8_t *)(0x42DE6290UL))
#define bFM4_GPIO_PDIR5_P4                        *((volatile  uint8_t *)(0x42DE6290UL))
#define bFM_GPIO_PDIR5_P5                         *((volatile  uint8_t *)(0x42DE6294UL))
#define bFM4_GPIO_PDIR5_P5                        *((volatile  uint8_t *)(0x42DE6294UL))
#define bFM_GPIO_PDIR5_P6                         *((volatile  uint8_t *)(0x42DE6298UL))
#define bFM4_GPIO_PDIR5_P6                        *((volatile  uint8_t *)(0x42DE6298UL))

#define bFM_GPIO_PDIR6_P0                         *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM4_GPIO_PDIR6_P0                        *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM_GPIO_PDIR6_P1                         *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM4_GPIO_PDIR6_P1                        *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM_GPIO_PDIR6_P2                         *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM4_GPIO_PDIR6_P2                        *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM_GPIO_PDIR6_P3                         *((volatile  uint8_t *)(0x42DE630CUL))
#define bFM4_GPIO_PDIR6_P3                        *((volatile  uint8_t *)(0x42DE630CUL))

#define bFM_GPIO_PDIR8_P0                         *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM4_GPIO_PDIR8_P0                        *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM_GPIO_PDIR8_P1                         *((volatile  uint8_t *)(0x42DE6404UL))
#define bFM4_GPIO_PDIR8_P1                        *((volatile  uint8_t *)(0x42DE6404UL))

#define bFM_GPIO_PDIRE_P0                         *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_P0                        *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM_GPIO_PDIRE_P2                         *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_P2                        *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM_GPIO_PDIRE_P3                         *((volatile  uint8_t *)(0x42DE670CUL))
#define bFM4_GPIO_PDIRE_P3                        *((volatile  uint8_t *)(0x42DE670CUL))

#define bFM_GPIO_PDOR0_P0                         *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P0                        *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM_GPIO_PDOR0_P1                         *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P1                        *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM_GPIO_PDOR0_P2                         *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P2                        *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM_GPIO_PDOR0_P3                         *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P3                        *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM_GPIO_PDOR0_P4                         *((volatile  uint8_t *)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P4                        *((volatile  uint8_t *)(0x42DE8010UL))
#define bFM_GPIO_PDOR0_P9                         *((volatile  uint8_t *)(0x42DE8024UL))
#define bFM4_GPIO_PDOR0_P9                        *((volatile  uint8_t *)(0x42DE8024UL))
#define bFM_GPIO_PDOR0_PA                         *((volatile  uint8_t *)(0x42DE8028UL))
#define bFM4_GPIO_PDOR0_PA                        *((volatile  uint8_t *)(0x42DE8028UL))
#define bFM_GPIO_PDOR0_PB                         *((volatile  uint8_t *)(0x42DE802CUL))
#define bFM4_GPIO_PDOR0_PB                        *((volatile  uint8_t *)(0x42DE802CUL))
#define bFM_GPIO_PDOR0_PC                         *((volatile  uint8_t *)(0x42DE8030UL))
#define bFM4_GPIO_PDOR0_PC                        *((volatile  uint8_t *)(0x42DE8030UL))
#define bFM_GPIO_PDOR0_PD                         *((volatile  uint8_t *)(0x42DE8034UL))
#define bFM4_GPIO_PDOR0_PD                        *((volatile  uint8_t *)(0x42DE8034UL))
#define bFM_GPIO_PDOR0_PE                         *((volatile  uint8_t *)(0x42DE8038UL))
#define bFM4_GPIO_PDOR0_PE                        *((volatile  uint8_t *)(0x42DE8038UL))

#define bFM_GPIO_PDOR1_P0                         *((volatile  uint8_t *)(0x42DE8080UL))
#define bFM4_GPIO_PDOR1_P0                        *((volatile  uint8_t *)(0x42DE8080UL))
#define bFM_GPIO_PDOR1_P1                         *((volatile  uint8_t *)(0x42DE8084UL))
#define bFM4_GPIO_PDOR1_P1                        *((volatile  uint8_t *)(0x42DE8084UL))
#define bFM_GPIO_PDOR1_P2                         *((volatile  uint8_t *)(0x42DE8088UL))
#define bFM4_GPIO_PDOR1_P2                        *((volatile  uint8_t *)(0x42DE8088UL))
#define bFM_GPIO_PDOR1_P3                         *((volatile  uint8_t *)(0x42DE808CUL))
#define bFM4_GPIO_PDOR1_P3                        *((volatile  uint8_t *)(0x42DE808CUL))
#define bFM_GPIO_PDOR1_P4                         *((volatile  uint8_t *)(0x42DE8090UL))
#define bFM4_GPIO_PDOR1_P4                        *((volatile  uint8_t *)(0x42DE8090UL))
#define bFM_GPIO_PDOR1_P5                         *((volatile  uint8_t *)(0x42DE8094UL))
#define bFM4_GPIO_PDOR1_P5                        *((volatile  uint8_t *)(0x42DE8094UL))
#define bFM_GPIO_PDOR1_P6                         *((volatile  uint8_t *)(0x42DE8098UL))
#define bFM4_GPIO_PDOR1_P6                        *((volatile  uint8_t *)(0x42DE8098UL))
#define bFM_GPIO_PDOR1_P7                         *((volatile  uint8_t *)(0x42DE809CUL))
#define bFM4_GPIO_PDOR1_P7                        *((volatile  uint8_t *)(0x42DE809CUL))
#define bFM_GPIO_PDOR1_P8                         *((volatile  uint8_t *)(0x42DE80A0UL))
#define bFM4_GPIO_PDOR1_P8                        *((volatile  uint8_t *)(0x42DE80A0UL))
#define bFM_GPIO_PDOR1_P9                         *((volatile  uint8_t *)(0x42DE80A4UL))
#define bFM4_GPIO_PDOR1_P9                        *((volatile  uint8_t *)(0x42DE80A4UL))
#define bFM_GPIO_PDOR1_PA                         *((volatile  uint8_t *)(0x42DE80A8UL))
#define bFM4_GPIO_PDOR1_PA                        *((volatile  uint8_t *)(0x42DE80A8UL))
#define bFM_GPIO_PDOR1_PB                         *((volatile  uint8_t *)(0x42DE80ACUL))
#define bFM4_GPIO_PDOR1_PB                        *((volatile  uint8_t *)(0x42DE80ACUL))

#define bFM_GPIO_PDOR2_P1                         *((volatile  uint8_t *)(0x42DE8104UL))
#define bFM4_GPIO_PDOR2_P1                        *((volatile  uint8_t *)(0x42DE8104UL))
#define bFM_GPIO_PDOR2_P2                         *((volatile  uint8_t *)(0x42DE8108UL))
#define bFM4_GPIO_PDOR2_P2                        *((volatile  uint8_t *)(0x42DE8108UL))
#define bFM_GPIO_PDOR2_P3                         *((volatile  uint8_t *)(0x42DE810CUL))
#define bFM4_GPIO_PDOR2_P3                        *((volatile  uint8_t *)(0x42DE810CUL))

#define bFM_GPIO_PDOR3_P0                         *((volatile  uint8_t *)(0x42DE8180UL))
#define bFM4_GPIO_PDOR3_P0                        *((volatile  uint8_t *)(0x42DE8180UL))
#define bFM_GPIO_PDOR3_P1                         *((volatile  uint8_t *)(0x42DE8184UL))
#define bFM4_GPIO_PDOR3_P1                        *((volatile  uint8_t *)(0x42DE8184UL))
#define bFM_GPIO_PDOR3_P2                         *((volatile  uint8_t *)(0x42DE8188UL))
#define bFM4_GPIO_PDOR3_P2                        *((volatile  uint8_t *)(0x42DE8188UL))
#define bFM_GPIO_PDOR3_P3                         *((volatile  uint8_t *)(0x42DE818CUL))
#define bFM4_GPIO_PDOR3_P3                        *((volatile  uint8_t *)(0x42DE818CUL))
#define bFM_GPIO_PDOR3_P9                         *((volatile  uint8_t *)(0x42DE81A4UL))
#define bFM4_GPIO_PDOR3_P9                        *((volatile  uint8_t *)(0x42DE81A4UL))
#define bFM_GPIO_PDOR3_PA                         *((volatile  uint8_t *)(0x42DE81A8UL))
#define bFM4_GPIO_PDOR3_PA                        *((volatile  uint8_t *)(0x42DE81A8UL))
#define bFM_GPIO_PDOR3_PB                         *((volatile  uint8_t *)(0x42DE81ACUL))
#define bFM4_GPIO_PDOR3_PB                        *((volatile  uint8_t *)(0x42DE81ACUL))
#define bFM_GPIO_PDOR3_PC                         *((volatile  uint8_t *)(0x42DE81B0UL))
#define bFM4_GPIO_PDOR3_PC                        *((volatile  uint8_t *)(0x42DE81B0UL))
#define bFM_GPIO_PDOR3_PD                         *((volatile  uint8_t *)(0x42DE81B4UL))
#define bFM4_GPIO_PDOR3_PD                        *((volatile  uint8_t *)(0x42DE81B4UL))
#define bFM_GPIO_PDOR3_PE                         *((volatile  uint8_t *)(0x42DE81B8UL))
#define bFM4_GPIO_PDOR3_PE                        *((volatile  uint8_t *)(0x42DE81B8UL))
#define bFM_GPIO_PDOR3_PF                         *((volatile  uint8_t *)(0x42DE81BCUL))
#define bFM4_GPIO_PDOR3_PF                        *((volatile  uint8_t *)(0x42DE81BCUL))

#define bFM_GPIO_PDOR4_P4                         *((volatile  uint8_t *)(0x42DE8210UL))
#define bFM4_GPIO_PDOR4_P4                        *((volatile  uint8_t *)(0x42DE8210UL))
#define bFM_GPIO_PDOR4_P5                         *((volatile  uint8_t *)(0x42DE8214UL))
#define bFM4_GPIO_PDOR4_P5                        *((volatile  uint8_t *)(0x42DE8214UL))
#define bFM_GPIO_PDOR4_P6                         *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P6                        *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM_GPIO_PDOR4_P7                         *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P7                        *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM_GPIO_PDOR4_P8                         *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P8                        *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM_GPIO_PDOR4_P9                         *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_P9                        *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM_GPIO_PDOR4_PB                         *((volatile  uint8_t *)(0x42DE822CUL))
#define bFM4_GPIO_PDOR4_PB                        *((volatile  uint8_t *)(0x42DE822CUL))
#define bFM_GPIO_PDOR4_PC                         *((volatile  uint8_t *)(0x42DE8230UL))
#define bFM4_GPIO_PDOR4_PC                        *((volatile  uint8_t *)(0x42DE8230UL))
#define bFM_GPIO_PDOR4_PD                         *((volatile  uint8_t *)(0x42DE8234UL))
#define bFM4_GPIO_PDOR4_PD                        *((volatile  uint8_t *)(0x42DE8234UL))
#define bFM_GPIO_PDOR4_PE                         *((volatile  uint8_t *)(0x42DE8238UL))
#define bFM4_GPIO_PDOR4_PE                        *((volatile  uint8_t *)(0x42DE8238UL))

#define bFM_GPIO_PDOR5_P0                         *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P0                        *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM_GPIO_PDOR5_P1                         *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P1                        *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM_GPIO_PDOR5_P2                         *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P2                        *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM_GPIO_PDOR5_P3                         *((volatile  uint8_t *)(0x42DE828CUL))
#define bFM4_GPIO_PDOR5_P3                        *((volatile  uint8_t *)(0x42DE828CUL))
#define bFM_GPIO_PDOR5_P4                         *((volatile  uint8_t *)(0x42DE8290UL))
#define bFM4_GPIO_PDOR5_P4                        *((volatile  uint8_t *)(0x42DE8290UL))
#define bFM_GPIO_PDOR5_P5                         *((volatile  uint8_t *)(0x42DE8294UL))
#define bFM4_GPIO_PDOR5_P5                        *((volatile  uint8_t *)(0x42DE8294UL))
#define bFM_GPIO_PDOR5_P6                         *((volatile  uint8_t *)(0x42DE8298UL))
#define bFM4_GPIO_PDOR5_P6                        *((volatile  uint8_t *)(0x42DE8298UL))

#define bFM_GPIO_PDOR6_P0                         *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P0                        *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P1                        *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM_GPIO_PDOR6_P2                         *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P2                        *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM_GPIO_PDOR6_P3                         *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P3                        *((volatile  uint8_t *)(0x42DE830CUL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P0                        *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM4_GPIO_PDOR8_P1                        *((volatile  uint8_t *)(0x42DE8404UL))

#define bFM_GPIO_PDORE_P0                         *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P0                        *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P2                        *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x42DE870CUL))
#define bFM4_GPIO_PDORE_P3                        *((volatile  uint8_t *)(0x42DE870CUL))

